Documents/ПутевойЛистЛегковогоАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПутевойЛистЛегковогоАвтомобиля</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выезды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗимаЛето</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Число</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыезда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВозвращения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНаряде</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпидометрПриВыезде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпидометрПриВозвращении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокТопливаПриВыезде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокТопливаПриВозвращении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаправленоТоплива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходТопливаПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходТопливаПоФакту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭкономияПерерасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПутевойЛистЛегковогоАвтомобиля/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ПутевойЛист(ТабДок, Ссылка) Экспорт
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Макет = Документы.ПутевойЛистЛегковогоАвтомобиля.ПолучитьМакет("ПутевойЛист");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПутевойЛист.Автомобиль КАК Автомобиль,
		|	ПутевойЛист.Автор КАК Автор,
		|	ПутевойЛист.Водитель КАК Водитель,
		|	ПутевойЛист.Дата КАК Дата,
		|	ПутевойЛист.ДатаПо КАК ДатаПо,
		|	ПутевойЛист.ДатаС КАК ДатаС,
		|	ПутевойЛист.Номер КАК Номер,
		|	ПутевойЛист.Выезды.(
		|		НомерСтроки КАК НомерСтроки,
		|		Число КАК Число,
		|		ВремяВыезда КАК ВремяВыезда,
		|		ВремяВозвращения КАК ВремяВозвращения,
		|		ВНаряде КАК ВНаряде,
		|		СпидометрПриВыезде КАК СпидометрПриВыезде,
		|		СпидометрПриВозвращении КАК СпидометрПриВозвращении,
		|		Пробег КАК Пробег,
		|		ОстатокТопливаПриВыезде КАК ОстатокТопливаПриВыезде,
		|		ОстатокТопливаПриВозвращении КАК ОстатокТопливаПриВозвращении,
		|		ЗаправленоТоплива КАК ЗаправленоТоплива,
		|		РасходТопливаПоНорме КАК РасходТопливаПоНорме,
		|		РасходТопливаПоФакту КАК РасходТопливаПоФакту,
		|		ЭкономияПерерасход КАК ЭкономияПерерасход
		|	) КАК Выезды
		|ИЗ
		|	Документ.ПутевойЛистЛегковогоАвтомобиля КАК ПутевойЛист
		|ГДЕ
		|	ПутевойЛист.Ссылка В(&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьПутевойЛистШапка = Макет.ПолучитьОбласть("ПутевойЛистШапка");
		ОбластьПутевойЛист = Макет.ПолучитьОбласть("ПутевойЛист");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		ТабДок.Очистить();
		
		ВставлятьРазделительСтраниц = Ложь;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ТабДок.Вывести(ОбластьПутевойЛистШапка);
			ВыборкаПутевойЛист = Выборка.Выезды.Выбрать();
			Пока ВыборкаПутевойЛист.Следующий() Цикл
				ОбластьПутевойЛист.Параметры.Заполнить(ВыборкаПутевойЛист);
				ТабДок.Вывести(ОбластьПутевойЛист, ВыборкаПутевойЛист.Уровень());
			КонецЦикла;
			
			Подвал.Параметры.ДатаС = Формат(Ссылка[0].ДатаС, "ДЛФ=ДД");
			Подвал.Параметры.ДатаПо = Формат(Ссылка[0].ДатаПо, "ДЛФ=ДД");
			Подвал.Параметры.Пробег = Ссылка[0].Выезды.Итог("Пробег");
			Подвал.Параметры.ЗаправленоТоплива = Ссылка[0].Выезды.Итог("ЗаправленоТоплива");
			Подвал.Параметры.РасходПоНорме = Ссылка[0].Выезды.Итог("РасходТопливаПоНорме");
			Подвал.Параметры.РасходПоФакту = Ссылка[0].Выезды.Итог("РасходТопливаПоФакту");
			Подвал.Параметры.Перерасход = Ссылка[0].Выезды.Итог("ЭкономияПерерасход");
			
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;
		
	#Иначе
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	#КонецЕсли	
КонецПроцедуры

#КонецОбласти
